{
  "1": {
    "description": "Balance number 1 represents independence, leadership, and new beginnings.",
    "advice": "Step confidently into leadership roles and trust your own abilities.",
    "master": false,
    "traits": ["Ambitious", "Independent", "Determined"],
    "strengths": ["Initiative", "Courage", "Self-reliance"],
    "weaknesses": ["Stubbornness", "Impatience", "Over-competitiveness"],
    "business": "You thrive in entrepreneurial roles where you can lead and innovate. Starting your own business or leading projects suits you well.",
    "relationships": "You seek partners who respect your independence and support your ambitions.",
    "purpose": "To pioneer new paths and inspire others by your example of courage and leadership.",
    "vibration": "Bold, pioneering, self-starting",
    "color": "Red",
    "element": "Fire",
    "insight": "Your energy drives progress and motivates others to take action.",
    "summary": "Balance 1 is the leader and initiator, full of courage and self-reliance."
  },
  "2": {
    "description": "Balance number 2 embodies cooperation, diplomacy, and sensitivity.",
    "advice": "Practice patience and foster harmonious relationships through understanding.",
    "master": false,
    "traits": ["Diplomatic", "Sensitive", "Supportive"],
    "strengths": ["Cooperation", "Empathy", "Tact"],
    "weaknesses": ["Indecisiveness", "Over-sensitivity", "Avoidance of conflict"],
    "business": "You excel in roles that require mediation, teamwork, and negotiation. Counseling, partnership businesses, or diplomacy are great fits.",
    "relationships": "You seek harmonious partnerships built on mutual respect and emotional connection.",
    "purpose": "To bring balance and peace through cooperation and understanding.",
    "vibration": "Peaceful, diplomatic, supportive",
    "color": "Orange",
    "element": "Water",
    "insight": "Your natural diplomacy allows you to unite differing viewpoints and create harmony.",
    "summary": "Balance 2 is the peacemaker, skilled in cooperation and empathy."
  }
,



  "3": {
    "description": "Balance number 3 inspires joyful self-expression and creativity, encouraging optimism.",
    "advice": "Express your ideas freely and nurture your creative talents.",
    "master": false,
    "traits": ["Creative", "Optimistic", "Social"],
    "strengths": ["Communication", "Joyfulness", "Imagination"],
    "weaknesses": ["Scattered energy", "Superficiality", "Impatience"],
    "business": "You shine in creative fields where you can express yourself and inspire others. Arts, media, or entertainment are great choices.",
    "relationships": "You seek partners who appreciate your creativity and bring joy and laughter into your life.",
    "purpose": "To inspire joy and creativity in the world through your unique self-expression.",
    "vibration": "Expressive, cheerful, inspiring",
    "color": "Yellow",
    "element": "Air",
    "insight": "Your energy thrives on communication and interaction, making you a natural storyteller and artist.",
    "summary": "Balance 3 brings optimism, creativity, and the power of joyful expression."
  },
  "4": {
    "description": "Balance number 4 brings structure and discipline, fostering responsibility and perseverance.",
    "advice": "Build strong foundations and maintain steady progress.",
    "master": false,
    "traits": ["Organized", "Reliable", "Practical"],
    "strengths": ["Discipline", "Hard work", "Patience"],
    "weaknesses": ["Rigidity", "Pessimism", "Over-cautiousness"],
    "business": "You excel in structured environments where you can build and maintain systems. Engineering, construction, or management are suitable.",
    "relationships": "You seek stable and reliable relationships built on trust and commitment.",
    "purpose": "To create lasting structures and systems that bring stability and order to the world.",
    "vibration": "Grounded, stable, secure",
    "color": "Green",
    "element": "Earth",
    "insight": "Your strength lies in creating order and stability, often becoming a reliable pillar for others.",
    "summary": "Balance 4 is about discipline, perseverance, and building solid foundations."
  },
  "5": {
    "description": "Balance number 5 encourages adaptability and freedom, helping overcome fear of change.",
    "advice": "Embrace new experiences with enthusiasm and balance freedom with responsibility.",
    "master": false,
    "traits": ["Adventurous", "Flexible", "Curious"],
    "strengths": ["Versatility", "Energy", "Open-mindedness"],
    "weaknesses": ["Restlessness", "Impulsiveness", "Inconsistency"],
    "business": "You thrive in dynamic environments where you can explore new opportunities. Sales, travel, or consulting are good options.",
    "relationships": "You seek partners who share your adventurous spirit and embrace change and excitement.",
    "purpose": "To explore the world and inspire others to embrace change and freedom.",
    "vibration": "Dynamic, energetic, free-spirited",
    "color": "Blue",
    "element": "Air",
    "insight": "Your adaptability makes you a natural explorer who brings fresh ideas and excitement.",
    "summary": "Balance 5 represents freedom, change, and dynamic energy."
  },
  "6": {
    "description": "Balance number 6 nurtures compassion and responsibility, focusing on home and community.",
    "advice": "Care for yourself and others with balance and love.",
    "master": false,
    "traits": ["Caring", "Responsible", "Protective"],
    "strengths": ["Nurturing", "Harmony", "Reliability"],
    "weaknesses": ["Overprotectiveness", "Worry", "Martyrdom"],
    "business": "You excel in roles where you can care for and support others. Teaching, nursing, or social work are ideal.",
    "relationships": "You seek loving and supportive relationships built on trust and commitment.",
    "purpose": "To heal and support others, creating harmony and balance in your community.",
    "vibration": "Loving, harmonious, protective",
    "color": "Indigo",
    "element": "Water",
    "insight": "You naturally create nurturing environments and promote peace and balance.",
    "summary": "Balance 6 is the number of care, responsibility, and harmony."
  },
  "7": {
    "description": "Balance number 7 supports introspection and spiritual growth, encouraging deep thinking.",
    "advice": "Take time for solitude and pursue knowledge to find inner peace.",
    "master": false,
    "traits": ["Analytical", "Introspective", "Wise"],
    "strengths": ["Insight", "Intuition", "Spiritual awareness"],
    "weaknesses": ["Isolation", "Skepticism", "Secretiveness"],
    "business": "You thrive in roles where you can research, analyze, and explore deeper truths. Science, philosophy, or spirituality are good choices.",
    "relationships": "You seek partners who respect your need for solitude and support your intellectual pursuits.",
    "purpose": "To uncover hidden truths and bring spiritual or intellectual insights to the world.",
    "vibration": "Mystical, intellectual, introspective",
    "color": "Violet",
    "element": "Water",
    "insight": "Your depth of thought and intuition guide you to profound understanding.",
    "summary": "Balance 7 is about wisdom, spirituality, and deep inner knowledge."
  },
  "8": {
    "description": "Balance number 8 focuses on power and material success, teaching balanced use of authority.",
    "advice": "Lead with integrity and balance ambition with compassion.",
    "master": false,
    "traits": ["Ambitious", "Practical", "Efficient"],
    "strengths": ["Leadership", "Organization", "Determination"],
    "weaknesses": ["Domineering", "Greed", "Workaholism"],
    "business": "You excel in leadership roles where you can manage resources and achieve success. Business, finance, or law are suitable.",
    "relationships": "You seek partners who are strong and supportive and share your ambition and drive.",
    "purpose": "To achieve material success and use your power to create a positive impact on the world.",
    "vibration": "Authoritative, determined, goal-oriented",
    "color": "Black",
    "element": "Earth",
    "insight": "Your power and drive can lead to great achievement when balanced with fairness.",
    "summary": "Balance 8 is the number of power, success, and responsible leadership."
  },
  "9": {
    "description": "Balance number 9 inspires compassion and humanitarianism, encouraging forgiveness and idealism.",
    "advice": "Practice empathy and let go of past grievances.",
    "master": false,
    "traits": ["Compassionate", "Generous", "Idealistic"],
    "strengths": ["Tolerance", "Creativity", "Vision"],
    "weaknesses": ["Overly sensitive", "Naivety", "Impatience"],
    "business": "You thrive in roles where you can serve others and make a positive impact. Charity work, social activism, or the arts are good choices.",
    "relationships": "You seek partners who share your compassion and are committed to making the world a better place.",
    "purpose": "To uplift humanity and contribute to a better world through selfless service and compassion.",
    "vibration": "Universal, empathetic, forgiving",
    "color": "White",
    "element": "Fire",
    "insight": "Your heart-centered nature inspires others to be kind and generous.",
    "summary": "Balance 9 embodies compassion, idealism, and humanitarianism."
  },
  "11": {
    "description": "Master number 11 balances spiritual insight with practicality, offering visionary leadership.",
    "advice": "Use your intuition wisely while staying grounded.",
    "master": true,
    "traits": ["Intuitive", "Inspirational", "Sensitive"],
    "strengths": ["Vision", "Creativity", "Empathy"],
    "weaknesses": ["Anxiety", "Overwhelm", "Emotional tension"],
    "business": "You excel in roles where you can inspire and guide others with your vision. Teaching, counseling, or spiritual leadership are ideal.",
    "relationships": "You seek partners who are spiritually aware and support your visionary pursuits.",
    "purpose": "To inspire and enlighten others with your spiritual insights and visionary leadership.",
    "vibration": "Illuminating, visionary, idealistic",
    "color": "Silver",
    "element": "Air",
    "insight": "You carry a powerful spiritual energy that can inspire transformation.",
    "summary": "Master 11 is the spiritual messenger, blending intuition with leadership."
  },
  "22": {
    "description": "Master number 22 balances big-picture vision with detail-oriented execution.",
    "advice": "Manifest your dreams through practical action and discipline.",
    "master": true,
    "traits": ["Powerful", "Pragmatic", "Organized"],
    "strengths": ["Leadership", "Vision", "Determination"],
    "weaknesses": ["Perfectionism", "Workaholism", "Stubbornness"],
    "business": "You thrive in roles where you can build and manage large-scale projects. Architecture, engineering, or global business are suitable.",
    "relationships": "You seek partners who are strong and supportive and share your vision and ambition.",
    "purpose": "To manifest your dreams into reality and create lasting structures that benefit humanity.",
    "vibration": "Master builder, visionary, powerhouse",
    "color": "Gold",
    "element": "Earth",
    "insight": "You combine vision with discipline, enabling you to create monumental achievements.",
    "summary": "Master 22 is the master builder who transforms dreams into reality."
  },
  "33": {
    "description": "Master number 33 balances spiritual service with personal responsibility.",
    "advice": "Serve others selflessly while maintaining your own well-being.",
    "master": true,
    "traits": ["Compassionate", "Selfless", "Inspirational"],
    "strengths": ["Healing", "Teaching", "Empathy"],
    "weaknesses": ["Self-sacrifice", "Overwhelmed", "Martyrdom"],
    "business": "You excel in roles where you can heal, teach, and uplift others. Counseling, social work, or spiritual guidance are ideal.",
    "relationships": "You seek partners who are compassionate and share your commitment to serving others.",
    "purpose": "To heal and uplift humanity through selfless service and unconditional love.",
    "vibration": "Divine teacher, healer, altruistic",
    "color": "Rose Pink",
    "element": "Water",
    "insight": "You embody unconditional love and inspire others through your selfless service.",
    "summary": "Master 33 is the master teacher and healer dedicated to service."
  }
}
