{
  "1": {
    "description": "Number 1 represents the archetype of the pioneer—the individualist who must develop courage, innovation, and a strong sense of self. This number's core lesson revolves around self-reliance, initiative, and the ability to lead with vision rather than domination.",
    "advice": "Stand firm in your convictions but avoid arrogance. Practice healthy independence without isolating others. Trust your instincts, but remain open to advice from those with experience.",
    "master": false,
    "element": "Fire",
    "traits": [
      "Independent",
      "Self-starting",
      "Visionary",
      "Goal-oriented",
      "Assertive",
      "Resilient",
      "Original",
      "Innovative",
      "Competitive"
    ],
    "strengths": [
      "Natural leadership",
      "Strategic thinking",
      "Trailblazing courage",
      "Ability to inspire others",
      "Initiative in problem-solving"
    ],
    "weaknesses": [
      "Overbearing or dominating behavior",
      "Impatience with others' pace",
      "Struggles with delegation",
      "Tendency toward isolation",
      "Difficulty accepting authority"
    ],
    "business": "Best suited for roles where autonomy and innovation are essential. Number 1 thrives as an entrepreneur, CEO, inventor, product designer, or startup founder. Also excels in leadership roles in competitive industries such as tech, sports, marketing, or politics.",
    "relationships": "Values independence and can be emotionally guarded. Needs a partner who respects their personal space, vision, and ambition. Can struggle with codependency or being overly controlling unless they learn emotional reciprocity.",
    "purpose": "To embody the spirit of self-determination. Number 1s are here to lead by example—boldly forging new paths, setting standards, and lighting the way for others to follow. They must overcome fear of failure to step into authentic leadership.",
    "vibration": "Assertive, pioneering, dynamic, determined, unapologetically individualistic",
    "color": "Red",
    "challenges": "Learning to collaborate without compromising individuality; avoiding ego-driven decisions; transforming loneliness into solitude with purpose.",
    "spiritual_lesson": "True power comes not from control, but from clarity of self-purpose. When aligned with their higher self, 1s become vessels of pure will and directed focus.",
    "health_influence": "Must manage stress levels and avoid burnout due to overwork. Prone to head-related issues (e.g., headaches, migraines) if frustrations are internalized.",
    "shadow_side": "Can become a tyrant instead of a leader. May suppress emotions and become emotionally rigid, refusing help out of pride. Needs to confront fears of vulnerability."
  }
,

 
  "2": {
    "description": "Number 2 is the archetype of the mediator, the harmonizer, and the intuitive collaborator. It represents duality, sensitivity, and the need for emotional equilibrium. Individuals under this vibration are learning the value of unity, emotional intelligence, and peaceful cooperation over dominance.",
    "advice": "Strengthen your emotional resilience without becoming emotionally numb. Cultivate your ability to support others while maintaining clear personal boundaries. Speak up for yourself with diplomacy rather than silence.",
    "master": false,
    "element": "Water",
    "traits": [
      "Empathetic",
      "Intuitive",
      "Diplomatic",
      "Supportive",
      "Patient",
      "Tactful",
      "Loyal",
      "Peace-seeking",
      "Gentle"
    ],
    "strengths": [
      "Excellent mediator and conflict resolver",
      "Deep emotional awareness",
      "Ability to bring people together harmoniously",
      "Listening and observing",
      "Reliable team player with strong loyalty"
    ],
    "weaknesses": [
      "Passive-aggressive tendencies",
      "Avoidance of conflict at all costs",
      "Over-sensitivity to criticism or rejection",
      "Tendency to be indecisive or overly dependent",
      "Sacrificing personal needs for peace"
    ],
    "business": "Thrives in roles that require cooperation, mediation, and emotional intelligence. Ideal careers include counseling, human resources, nursing, diplomacy, customer service, event coordination, or the arts—especially music and design, where nuance is key.",
    "relationships": "Seeks deep emotional connection and mutual respect. A natural nurturer, Number 2 flourishes in harmonious, supportive partnerships. Needs to avoid losing identity in relationships and learn to voice their own needs clearly.",
    "purpose": "To embody the power of connection, intuition, and emotional depth. The 2 is here to unify opposites, promote harmony, and teach the value of patience, timing, and soft power.",
    "vibration": "Gentle, patient, emotionally attuned, collaborative, peaceful",
    "color": "Blue",
    "challenges": "Overcoming fear of confrontation and abandonment. Learning to assert needs without guilt or retreat. Must balance giving with receiving.",
    "spiritual_lesson": "Real strength lies in sensitivity. When tuned into their higher self, 2s become vessels for divine empathy and conduits of healing in all environments.",
    "health_influence": "Must protect against emotional burnout and psychosomatic issues tied to repression (e.g., digestion, reproductive health). Requires frequent emotional grounding.",
    "shadow_side": "May manipulate through guilt or silence, retreat from responsibility, or remain in toxic dynamics for the sake of false harmony. Needs to confront the fear of disapproval to evolve."
  },

  
  "3": {
    "description": "Number 3 is the vibration of self-expression, joy, and creative energy. It represents the artist, the storyteller, and the uplifter. Those with strong 3 energy are here to learn how to express their truth openly, share their talents, and inspire others through communication and beauty.",
    "advice": "Use your voice and talents with intention. Don’t hide behind humor or charm to avoid vulnerability. When you stay grounded, your creativity becomes a powerful force of healing and inspiration.",
    "master": false,
    "element": "Air",
    "traits": [
      "Expressive",
      "Creative",
      "Charismatic",
      "Imaginative",
      "Witty",
      "Optimistic",
      "Playful",
      "Sociable",
      "Charming"
    ],
    "strengths": [
      "Natural talent in writing, speaking, and performing",
      "Ability to uplift and entertain others",
      "Creative thinker with unique perspective",
      "Optimistic and lighthearted in tough situations",
      "Magnetic personality that draws others in"
    ],
    "weaknesses": [
      "Tendency to avoid depth or emotional responsibility",
      "Scattered energy or difficulty following through",
      "Superficiality or reliance on appearances",
      "Mood swings masked by forced positivity",
      "Fear of criticism that leads to self-censorship"
    ],
    "business": "Excels in careers that involve creativity, communication, and people interaction. Ideal fields include the arts, media, entertainment, teaching, writing, public relations, marketing, and any platform for storytelling or expression.",
    "relationships": "Desires fun, affection, and emotional connection. May struggle with commitment or emotional depth early in life. Needs partners who respect their need for creativity and space to express. Can be romantic and loving when emotionally secure.",
    "purpose": "To inspire others by expressing truth through creativity. The 3 must learn to channel their emotional depth into art, communication, or teaching, rather than suppress or avoid it.",
    "vibration": "Joyful, expressive, magnetic, artistic, enthusiastic",
    "color": "Yellow",
    "challenges": "Learning to communicate with depth, not just charm. Must overcome the fear of judgment and perfectionism. Needs to manage emotional highs and lows with maturity.",
    "spiritual_lesson": "Creativity is sacred. When the 3 honors their inner voice and expresses it with integrity, they become a source of healing and joy to those around them.",
    "health_influence": "Emotional suppression can impact the throat, respiratory system, and nervous system. Should prioritize self-expression and creative outlets to maintain mental and emotional well-being.",
    "shadow_side": "May become attention-seeking, narcissistic, or emotionally evasive when wounded. Can hide behind humor, sarcasm, or distraction. Needs to embrace vulnerability to fully evolve."
  },
  
  "4": {
    "description": "Number 4 embodies structure, practicality, and endurance. It represents the foundation on which great things are built—slowly, methodically, and with discipline. People with 4 energy are here to master patience, responsibility, and long-term planning. They often take on the role of protector, provider, and system builder.",
    "advice": "Stay disciplined but remain open to change. Life may test you with obstacles that develop your inner strength. Avoid becoming rigid or overly controlling—balance order with adaptability.",
    "master": false,
    "element": "Earth",
    "traits": [
      "Hardworking",
      "Reliable",
      "Methodical",
      "Grounded",
      "Practical",
      "Loyal",
      "Detail-oriented",
      "Persistent"
    ],
    "strengths": [
      "Exceptional planning and organizational skills",
      "Loyal and dependable in relationships and business",
      "Strong work ethic and ability to follow through",
      "Grounded in reality and unaffected by emotional volatility",
      "Trustworthy, steady, and highly responsible"
    ],
    "weaknesses": [
      "Stubbornness and resistance to change",
      "Pessimism or excessive realism that limits possibilities",
      "Inflexibility in beliefs or methods",
      "Tendency to overwork and neglect emotional needs",
      "May struggle with spontaneity or creative risk-taking"
    ],
    "business": "Thrives in structured environments such as engineering, construction, architecture, administration, finance, law enforcement, farming, and corporate roles. Any career involving systems, rules, and practical outcomes suits the 4.",
    "relationships": "Seeks stability, loyalty, and predictability. May be slow to trust but deeply committed once they do. Struggles in chaotic or emotionally unpredictable relationships. Needs a partner who values order and supports their goals.",
    "purpose": "To build lasting foundations—whether in business, community, or family—by mastering patience, integrity, and discipline.",
    "vibration": "Stable, grounded, organized, enduring",
    "color": "Green",
    "challenges": "Learning to adapt without sacrificing structure. Must avoid being overcritical or cold in relationships. Needs to embrace flexibility and emotional expression.",
    "spiritual_lesson": "True strength comes not just from discipline but from knowing when to yield. Embrace the unexpected as part of divine order.",
    "health_influence": "Prone to stress-related issues affecting bones, joints, and digestion due to overwork or rigidity. Needs regular rest and work-life balance.",
    "shadow_side": "Can become obsessive with control, perfectionism, or overly harsh toward self and others. Fear of chaos may lead to micromanagement or emotional suppression."
  },
  "5": {
    "description": "Number 5 symbolizes change, adventure, and liberation. It is the energy of the explorer, the rebel, the communicator. Those with strong 5 energy are here to experience life in all its variety and to help others break free from fear and limitations. 5s are highly adaptable, curious, and spirited—but must learn discipline and focus to reach their potential.",
    "advice": "Embrace your adventurous nature but learn to channel it constructively. Discipline does not limit your freedom—it empowers it. Avoid impulsive decisions and maintain direction amidst chaos.",
    "master": false,
    "element": "Air",
    "traits": [
      "Adventurous",
      "Energetic",
      "Quick-witted",
      "Charismatic",
      "Flexible",
      "Curious",
      "Spontaneous",
      "Playful"
    ],
    "strengths": [
      "Incredible adaptability and resourcefulness",
      "Magnetic social presence and natural charm",
      "Excellent communicator and storyteller",
      "Thrives in dynamic or high-pressure environments",
      "Willingness to take risks and pursue innovation"
    ],
    "weaknesses": [
      "Easily bored or distracted",
      "Lack of consistency or follow-through",
      "Can be unreliable or commitment-averse",
      "May use pleasure or escapism to avoid responsibility",
      "Impulsiveness leading to avoidable mistakes"
    ],
    "business": "Well-suited for careers in media, travel, sales, marketing, entertainment, broadcasting, technology, and anything requiring adaptability and communication. They also thrive as freelancers or digital nomads.",
    "relationships": "Craves excitement and novelty. May resist settling down unless they feel free within the relationship. Needs a partner who embraces their ever-evolving nature without trying to cage them.",
    "purpose": "To explore, experience, and inspire change. The 5 must learn to harness freedom with discipline to achieve lasting impact in their lives and others’. They are meant to break boundaries.",
    "vibration": "Electric, magnetic, exciting, unconventional",
    "color": "Orange",
    "challenges": "Must overcome restlessness, irresponsibility, and the urge to escape discomfort. Learning moderation and self-control is key.",
    "spiritual_lesson": "True freedom arises from inner mastery, not external escape. Discipline is the foundation for real adventure.",
    "health_influence": "High-strung energy can affect the nervous system, hormones, or digestion. Needs regular grounding, movement, and conscious routine.",
    "shadow_side": "May become reckless, manipulative, or overly indulgent. Can burn bridges or sabotage success due to impatience or fear of being 'trapped'."
  },

  
  "6": {
    "description": "Number 6 is the embodiment of love, service, and responsibility. It carries a vibration of compassion, healing, and domestic harmony. People with 6 energy often feel called to care for others and restore balance in their families or communities. They are protectors, idealists, and natural mediators—but must avoid self-sacrifice and overattachment.",
    "advice": "Learn to give without losing yourself. Maintain healthy boundaries while honoring your deep need to support and nurture others. Seek beauty and harmony, but do not fall into idealism or co-dependence.",
    "master": false,
    "element": "Earth",
    "traits": [
      "Caring",
      "Responsible",
      "Protective",
      "Supportive",
      "Idealistic",
      "Devoted",
      "Artistic",
      "Peacemaking"
    ],
    "strengths": [
      "Strong sense of duty and commitment",
      "Deep empathy and emotional intelligence",
      "Ability to create harmony in chaotic environments",
      "Loyalty and dependability in relationships",
      "Natural ability to heal, comfort, and teach"
    ],
    "weaknesses": [
      "Tendency to over-give or martyr oneself",
      "Judgmental or controlling under stress",
      "Difficulty saying no or enforcing boundaries",
      "Can become overly idealistic or perfectionistic",
      "Resentment from feeling unappreciated"
    ],
    "business": "Thrives in caregiving, teaching, counseling, healing arts, social work, hospitality, beauty/fashion, interior design, nonprofit work, and artistic fields. Seeks meaning in service.",
    "relationships": "Deeply loyal and emotionally invested. Seeks long-term, nurturing partnerships. Must learn to balance their desire to 'fix' others with the need to let them grow independently.",
    "purpose": "To bring love, balance, and healing into the world. To protect and uplift others through compassionate action and artistic expression.",
    "vibration": "Loving, peaceful, supportive, idealistic",
    "color": "Blue",
    "challenges": "Must overcome guilt, codependency, and emotional overinvestment. Learning that love doesn’t require sacrifice is key to their evolution.",
    "spiritual_lesson": "Love is strongest when given freely, not as obligation. True service uplifts both the giver and the receiver.",
    "health_influence": "Sensitive to emotional stress and family tension. Prone to issues affecting the heart, throat, or hormonal balance. Needs self-care rituals and personal time.",
    "shadow_side": "Can become manipulative under the guise of care, enabling others, or becoming consumed by control masked as protection."
  },
  "7": {
    "description": "Number 7 represents introspection, analysis, and spiritual depth. It is the number of the thinker, the philosopher, the truth-seeker. Those with a 7 vibration are naturally curious about life’s deeper mysteries and often walk a solitary or inward path in pursuit of knowledge and inner truth. They must balance intellect with intuition.",
    "advice": "Honor your need for solitude and reflection, but do not isolate. Trust your inner voice as much as your rational mind. Keep seeking truth, but remember that wisdom also lives in the heart.",
    "master": false,
    "element": "Water",
    "traits": [
      "Analytical",
      "Wise",
      "Spiritual",
      "Private",
      "Observant",
      "Introspective",
      "Skeptical",
      "Philosophical"
    ],
    "strengths": [
      "Highly intuitive and mentally sharp",
      "Excellent at research, analysis, and strategy",
      "Strong spiritual insight and philosophical depth",
      "Able to detach emotionally for clarity",
      "Loyal in relationships once trust is earned"
    ],
    "weaknesses": [
      "Prone to isolation and emotional withdrawal",
      "Overly skeptical or distrustful",
      "Difficulty expressing emotions or asking for help",
      "May appear aloof, cold, or superior",
      "Can be overly critical or pessimistic"
    ],
    "business": "Thrives in science, psychology, spirituality, research, programming, engineering, writing, academia, detective work, and strategic planning. Prefers independent or behind-the-scenes roles.",
    "relationships": "Highly private and slow to trust. Needs mental and spiritual connection more than physical. Can struggle with vulnerability and may seem distant to emotional partners.",
    "purpose": "To uncover universal truths and guide others through wisdom, insight, and higher awareness. Seeks both divine connection and intellectual mastery.",
    "vibration": "Mystical, cerebral, observant, solitary",
    "color": "Purple",
    "challenges": "Balancing intellect and emotion. Overcoming loneliness, distrust, and overthinking. Needs to trust intuition without requiring constant proof.",
    "spiritual_lesson": "Knowledge becomes wisdom only when applied with love. Trust the unseen. Let go of the need to control outcomes through logic alone.",
    "health_influence": "May experience nervous system imbalances or vision/neurological issues. Needs time for deep rest, meditation, and nature to recharge.",
    "shadow_side": "Can become cynical, paranoid, or elitist. May disconnect from the world in pursuit of unattainable perfection or fear of rejection."
  },

  "8": {
    "description": "Number 8 represents power, ambition, and material mastery. It is the number of authority, leadership, and financial control. People with strong 8 energy are born to achieve, build, and influence. Their lessons often center around ethical use of power and the balance between spiritual values and material success.",
    "advice": "Embrace your ambition, but temper it with wisdom and integrity. Learn to balance the outer pursuit of power with inner emotional grounding and responsibility.",
    "master": false,
    "element": "Earth",
    "traits": [
      "Ambitious",
      "Confident",
      "Efficient",
      "Authoritative",
      "Strategic",
      "Resilient",
      "Disciplined",
      "Goal-oriented"
    ],
    "strengths": [
      "Natural leader with executive capabilities",
      "Highly organized and results-focused",
      "Resilient and able to thrive under pressure",
      "Strong sense of justice and fairness",
      "Powerful ability to manifest material success"
    ],
    "weaknesses": [
      "Can become overly controlling or domineering",
      "Workaholic tendencies, emotionally distant",
      "Prone to material obsession or power struggles",
      "May judge success solely by financial metrics",
      "Trust issues and fear of vulnerability"
    ],
    "business": "Excels in entrepreneurship, finance, management, law, real estate, executive roles, politics, or large-scale operations. Strong acumen for building empires and managing money.",
    "relationships": "Protective but emotionally guarded. Needs a partner who respects their independence and supports their ambitions. Must learn to open up emotionally and not equate love with control or performance.",
    "purpose": "To master power, leadership, and abundance with spiritual responsibility. To inspire others through disciplined action and ethical influence.",
    "vibration": "Powerful, grounded, authoritative, transformative",
    "color": "Black or deep gray",
    "challenges": "Learning humility, trust, and emotional openness. Balancing achievement with compassion. Avoiding karmic traps tied to greed or domination.",
    "spiritual_lesson": "True power uplifts, not controls. Lasting success is built on ethical foundations. Align ambition with soul purpose for unstoppable progress.",
    "health_influence": "May suffer from stress-related illnesses, blood pressure issues, or lower back strain. Needs to prioritize work-life balance and emotional expression.",
    "shadow_side": "Can become ruthless, manipulative, or emotionally disconnected. Risks karma through unethical gain or material obsession."
  },


 
  
  "9": {
    "description": "Number 9 embodies compassion, wisdom, and universal love. It represents the culmination of all the other numbers—an old soul vibration. People influenced by 9 are often idealists, artists, or humanitarians with deep empathy and a drive to uplift others. Their life path often involves surrender, forgiveness, and service.",
    "advice": "Let go of what no longer serves your highest good. Accept endings as necessary for growth. Focus your energy on service without losing your personal identity.",
    "master": false,
    "element": "Fire",
    "traits": [
      "Compassionate",
      "Romantic",
      "Idealistic",
      "Intuitive",
      "Altruistic",
      "Wise",
      "Forgiving",
      "Creative"
    ],
    "strengths": [
      "Deeply empathic and emotionally intelligent",
      "Strong desire to help, heal, and uplift humanity",
      "Artistic and expressive, with visionary gifts",
      "Able to release the past and evolve",
      "Naturally spiritual and inclusive"
    ],
    "weaknesses": [
      "Can become overly idealistic or martyr-like",
      "Difficulty setting boundaries or saying no",
      "Emotionally intense or moody",
      "May struggle with letting go or closure",
      "Feels misunderstood or lonely at times"
    ],
    "business": "Thrives in the arts, healing professions, activism, counseling, spiritual work, philanthropy, or nonprofit leadership. Needs mission-driven work over profit-driven roles.",
    "relationships": "Romantic and emotionally rich. Can attract emotionally wounded partners. Needs a relationship rooted in mutual growth and shared values. May fear abandonment or feel the need to save others.",
    "purpose": "To heal, inspire, and uplift the world through compassion, forgiveness, and creative expression. To live in alignment with spiritual truth and higher service.",
    "vibration": "Universal, emotional, spiritual, expansive",
    "color": "Gold",
    "challenges": "Letting go of the past. Avoiding martyrdom. Learning that true service comes from wholeness, not sacrifice. Setting clear personal boundaries.",
    "spiritual_lesson": "Release is not loss—it is transformation. You are here to serve, but not to suffer. Find peace in impermanence and love in all things.",
    "health_influence": "Prone to emotional burnout, autoimmune issues, or immune system sensitivity. Needs regular emotional cleansing, creative outlets, and solitude.",
    "shadow_side": "May become overly self-sacrificing, emotionally volatile, or resentful. Can manipulate through guilt or feel victimized by the world's pain."
  },
  
  "11": {
    "description": "Number 11 is the spiritual messenger, embodying divine intuition, enlightenment, and inspiration. It is a master number representing a bridge between the material and spiritual worlds, gifted with heightened perception and visionary insight. People with 11 often feel a deep inner calling to awaken others and serve higher purposes.",
    "advice": "Ground your powerful intuition in everyday reality. Manage emotional intensity through mindfulness and disciplined practices. Avoid anxiety and self-doubt by cultivating confidence in your spiritual gifts.",
    "master": true,
    "element": "Ether / Air",
    "traits": [
      "Highly intuitive",
      "Visionary",
      "Inspirational",
      "Sensitive",
      "Idealistic",
      "Creative"
    ],
    "strengths": [
      "Deep spiritual insight and clairvoyance",
      "Magnetic presence that inspires others",
      "Empathy and emotional intelligence",
      "Artistic and communicative talents"
    ],
    "weaknesses": [
      "Tendency toward nervous tension and anxiety",
      "Emotional overwhelm",
      "Self-doubt and sensitivity to criticism",
      "Difficulty balancing spiritual ideals with practical life"
    ],
    "business": "Excels in creative arts, counseling, spiritual healing, teaching metaphysics, inspirational speaking, and roles requiring empathy and vision. Needs meaningful work aligned with soul purpose.",
    "relationships": "Seeks deep, soulful connections often involving karmic bonds. Requires emotional space and trust to fully share inner depths. May struggle with vulnerability and fear of rejection.",
    "purpose": "To serve as a spiritual beacon, inspiring and awakening others to higher consciousness through vision, creativity, and compassion.",
    "vibration": "Illuminating, transcendent, electric",
    "color": "Silver-Violet",
    "challenges": "Managing high sensitivity and anxiety. Avoiding escapism or emotional overwhelm. Balancing spiritual ideals with everyday responsibilities.",
    "spiritual_lesson": "Learning to channel divine inspiration into grounded, practical action. Recognizing your gifts as a light for others without losing self in the process.",
    "health_influence": "Prone to nervous system disorders, anxiety, insomnia. Benefits from meditation, grounding exercises, and emotional release techniques.",
    "shadow_side": "Can become overly anxious, emotionally unstable, or self-absorbed in spiritual pursuits. Risk of escapism or feeling isolated by heightened sensitivity."
  },
  "22": {
    "description": "Number 22 is the Master Builder, combining visionary dreams with practical ability to manifest on a grand scale. It represents power, discipline, and the capacity to create lasting impact in the physical world. Those with 22 often have a mission to improve society through tangible achievements.",
    "advice": "Harness your immense potential with discipline and patience. Avoid fear of failure or self-doubt by building strong foundations. Balance visionary thinking with methodical execution.",
    "master": true,
    "element": "Earth / Ether",
    "traits": [
      "Ambitious",
      "Pragmatic",
      "Disciplined",
      "Visionary",
      "Strategic",
      "Responsible"
    ],
    "strengths": [
      "Exceptional organizational and leadership skills",
      "Ability to manifest large-scale projects",
      "Strong sense of responsibility and integrity",
      "Balanced combination of intuition and logic"
    ],
    "weaknesses": [
      "Risk of overwhelm due to high expectations",
      "May become rigid, controlling, or emotionally detached",
      "Fear of failure or self-sabotage",
      "Difficulty delegating or asking for help"
    ],
    "business": "Ideal for careers in architecture, engineering, government, philanthropy, entrepreneurship, large-scale project management, and social reform.",
    "relationships": "Needs loyal, supportive partners who respect their mission. May prioritize work over emotional needs, leading to potential imbalance.",
    "purpose": "To build sustainable, transformative structures—both literal and metaphorical—that benefit humanity and leave a lasting legacy.",
    "vibration": "Masterful, enduring, visionary",
    "color": "Gold",
    "challenges": "Managing stress and overwhelm. Overcoming fear of power and failure. Learning emotional openness and flexibility.",
    "spiritual_lesson": "Realizing that true power lies in service, humility, and perseverance. Building not only material success but also spiritual foundations.",
    "health_influence": "May experience stress-related health issues like hypertension or autoimmune conditions. Needs regular relaxation, healthy boundaries, and support.",
    "shadow_side": "Can become overly controlling, rigid, or disconnected from emotions. May neglect personal wellbeing in pursuit of goals."
  },
  "33": {
    "description": "Number 33 is the Master Teacher and the most spiritually evolved master number. It embodies unconditional love, compassion, healing, and nurturing service. People with 33 have a strong desire to uplift humanity through selfless care, guidance, and wisdom.",
    "advice": "Balance your tendency to over-give with self-care. Avoid martyrdom by setting clear boundaries. Express your gifts through loving leadership and practical compassion.",
    "master": true,
    "element": "Fire / Water",
    "traits": [
      "Compassionate",
      "Wise",
      "Selfless",
      "Healing",
      "Nurturing",
      "Inspirational"
    ],
    "strengths": [
      "Exceptional empathy and spiritual wisdom",
      "Natural healer and teacher",
      "Ability to inspire unconditional love and harmony",
      "Strong sense of duty to serve others"
    ],
    "weaknesses": [
      "Risk of emotional burnout and martyrdom",
      "Difficulty saying no or maintaining boundaries",
      "Tendency to neglect own needs for others",
      "Can feel overwhelmed by responsibility"
    ],
    "business": "Thrives in healing professions, counseling, education, social work, ministry, nonprofit leadership, and any role involving nurturing and teaching.",
    "relationships": "Seeks deep, meaningful partnerships based on mutual care and spiritual growth. Needs to avoid codependency and maintain personal boundaries.",
    "purpose": "To embody and teach unconditional love, compassion, and healing—transforming individuals and communities through service.",
    "vibration": "Loving, nurturing, transformative",
    "color": "Turquoise / Rose Gold",
    "challenges": "Avoiding martyr complex and emotional exhaustion. Balancing giving with receiving. Staying grounded amid high expectations.",
    "spiritual_lesson": "True service comes from wholeness, not sacrifice. Learning to love oneself as deeply as others.",
    "health_influence": "Prone to stress-related ailments, fatigue, and emotional exhaustion. Benefits greatly from restorative practices, healthy boundaries, and spiritual connection.",
    "shadow_side": "May become codependent, overly self-sacrificing, or emotionally drained. Risk of neglecting self in pursuit of service."
  }
}
