{
  
  "1": {
    "description": "You are a natural leader with strong ambition and a pioneering spirit, often the first to take initiative and forge new paths. You possess an innate drive to achieve and make your mark, inspiring others through your unwavering self-belief and a clear vision for the future.",
    "advice": "Focus your considerable energy to avoid the pitfalls of impatience and stubbornness. Practice active listening, learn to delegate effectively, and break down large goals into manageable steps to maintain momentum without overwhelming others or becoming easily frustrated by perceived delays.",
    "master": false,
    "element": "Fire – Signifying intense passion, dynamism, transformative power, and a drive that can illuminate or consume if not managed. It fuels your ambition and courage.",
    "traits": [
      "Independent – Thriving on autonomy and self-reliance, preferring to make your own decisions and carve your own unique path forward.",
      "Determined – Pursuing goals with unwavering focus, resilience, and an unwillingness to be easily deterred by obstacles or setbacks.",
      "Innovative – Possessing a mind keen on originality and forward-thinking, constantly seeking novel solutions, fresh perspectives, and improvements."
    ],
    "strengths": [
      "Confident – Exhibiting strong self-belief and assurance in your capabilities, which empowers you to take decisive and bold action.",
      "Courageous – Showing bravery in the face of adversity, uncertainty, and a willingness to take calculated risks for desired significant outcomes.",
      "Ambitious – Driven by a strong desire for success, achievement, recognition, and making a substantial impact in your chosen endeavors."
    ],
    "weaknesses": [
      "Impatient – Can become easily frustrated by delays, slower paces, or lack of immediate results, potentially leading to hasty decisions.",
      "Domineering – May unintentionally overpower others or dismiss their input due to a strong will and an assertive desire to lead from the front.",
      "Self-centered – Intense focus on personal goals and vision can sometimes lead to overlooking the needs, feelings, or contributions of others in the team."
    ],
    "business": "Entrepreneurship, executive leadership roles (CEO, director), founding new ventures, project management and initiation, innovation strategy, independent consulting, political leadership, or any field demanding strong initiative, vision, and the ability to spearhead change.",
    "relationships": "You seek partners who deeply respect your independence, understand your powerful drive, and wholeheartedly support your ambitions without feeling overshadowed. A relationship built on mutual empowerment, shared goals (or at least mutual respect for individual ones), and strong personal identities where both partners can shine is ideal.",
    "purpose": "To lead, innovate, and inspire others by demonstrating the power of vision, courage, and unwavering determination. You are meant to be a trailblazer, initiating change, challenging the status quo, and motivating others to achieve their highest potential and embrace new possibilities.",
    "color": "Red – Symbolizing raw energy, intense passion, decisive action, bold leadership, and the courage to pioneer. It reflects your driving force, assertiveness, and zest for life.",
    "vibration": "Strong, assertive, and energizing – Your presence often carries a powerful and palpable energy that can motivate, galvanize, and instill a sense of urgency and purpose in those around you, commanding attention."
  },
  "2": {
    "description": "You are cooperative, sensitive, and a great peacemaker, possessing an innate ability to understand and connect with others on an emotional level. Your gentle strength lies in fostering harmony and building bridges between people.",
    "advice": "Learn to assert yourself more confidently and avoid being overly passive or self-sacrificing. Practice setting healthy boundaries, voicing your own needs and opinions respectfully, and understanding that your perspective is valuable even if it differs from others. Embrace constructive conflict as a path to deeper understanding.",
    "master": false,
    "element": "Water – Reflecting your fluidity, empathy, intuitive nature, and ability to adapt. Like water, you seek emotional depth and can subtly shape your environment.",
    "traits": [
      "Diplomatic – Skilled in handling sensitive situations with tact and grace, finding common ground and facilitating understanding between differing parties.",
      "Tactful – Considerate of others' feelings, choosing words and actions carefully to avoid causing offense and to maintain positive interactions.",
      "Supportive – A natural nurturer and encourager, consistently providing a listening ear, emotional backing, and steadfast help to those in need."
    ],
    "strengths": [
      "Patient – Able to remain calm and understanding during delays or when dealing with complex interpersonal dynamics, allowing things to unfold naturally.",
      "Empathetic – Possessing a profound capacity to understand, share, and validate the feelings of others, making you a compassionate and trusted confidant.",
      "Loyal – Steadfast and devoted in your commitments to people, causes, and relationships you believe in, offering unwavering support through thick and thin."
    ],
    "weaknesses": [
      "Indecisive – Your ability to see all perspectives and desire to please everyone can sometimes lead to difficulty in making firm choices or taking a stand.",
      "Overly Sensitive – Can be easily affected by harsh words, negative atmospheres, or criticism, sometimes taking things too personally or internalizing negativity.",
      "Avoids Conflict – Your strong desire for harmony can lead you to shy away from necessary confrontations or difficult conversations, potentially allowing issues to fester unresolved."
    ],
    "business": "Mediation, counseling, human resources, diplomacy, teaching, healthcare (especially roles involving patient care and advocacy), social work, non-profit organizations, partnership roles requiring strong collaboration, customer service leadership, or any field that values interpersonal skills and the ability to foster harmony and understanding.",
    "relationships": "You thrive in harmonious, emotionally intimate relationships built on deep trust, mutual understanding, and open communication. You seek a partner who is emotionally available, gentle, communicative, values shared feelings, and offers reciprocal care and support. Emotional security is paramount.",
    "purpose": "To bring peace, healing, and harmony to the world through acts of cooperation, profound understanding, and compassionate connection. This can manifest in your personal relationships, your chosen work, your community involvement, or by championing causes that promote unity and empathy.",
    "color": "Orange – Symbolizing warmth, emotional expression, creativity, balance, and approachability. It reflects your nurturing, receptive, and harmonizing nature.",
    "vibration": "Calming, sensitive, and harmonizing – Your presence often has a soothing, gentle effect on others, making them feel understood, accepted, and at ease. You help to smooth rough edges and foster a sense of peace in group dynamics."
  },
  "3": {
    "description": "Creative and expressive, you bring joy, enthusiasm, and a spark of brilliance to life. You have a natural ability to uplift others with your optimistic outlook, your gift for communication, and your imaginative flair. You often have many diverse interests and a vibrant inner world you're eager to share.",
    "advice": "Channel your abundant creative energy into focused pursuits to bring your many ideas to fruition. Develop discipline to see projects through to completion by identifying your most passionate endeavors and establishing structures or routines that support sustained creative flow, rather than scattering your energies too thinly.",
    "master": false,
    "element": "Air – Signifying your intellect, communication skills, sociability, and love of ideas. Like air, you are often light, expansive, quick-witted, and able to connect disparate concepts.",
    "traits": [
      "Artistic – Possessing a natural talent for or a deep appreciation of the arts, whether it be visual, performing, literary, or any form of creative expression.",
      "Optimistic – Tending to look on the bright side of life, maintaining a hopeful and positive attitude even in challenging times, inspiring others with your sunny disposition.",
      "Sociable – Enjoying interaction with a wide variety of people, making new connections easily, and thriving in social settings where you can share your thoughts and humor."
    ],
    "strengths": [
      "Charismatic – Having a natural charm, magnetism, and ability to draw people to you, often inspiring and engaging them with your words, ideas, and infectious enthusiasm.",
      "Imaginative – Possessing a rich inner world, a vivid imagination, and an ability to easily generate novel ideas, compelling stories, or unique solutions to problems.",
      "Energetic – Exuding a vibrant, lively, and dynamic spirit that can be infectious, motivating, and uplifting to those around you."
    ],
    "weaknesses": [
      "Scattered – Your enthusiasm for many different things can lead to a lack of follow-through, difficulty concentrating on one task for long, or starting many projects without finishing them.",
      "Restless – You may find it hard to stay in one place, on one project, or with one idea for too long, always seeking new stimulation, experiences, or creative outlets.",
      "Superficial – In your desire to be liked, to keep things light and positive, or due to a short attention span, you might sometimes avoid deeper emotional engagement or complex, serious topics."
    ],
    "business": "Arts (acting, music, design, painting, illustration), entertainment industry, writing (novelist, journalist, copywriter), public speaking, marketing and advertising, media and communications, event planning, teaching (especially creative subjects), comedy, or any field that values originality, communication, and imaginative expression.",
    "relationships": "You seek partners who appreciate your vibrant creativity, share your zest for life, and bring joy, laughter, and stimulating conversation into your life. A playful, communicative partner who encourages your self-expression and isn't afraid of spontaneity will be a great match. Intellectual connection and shared fun are key.",
    "purpose": "To inspire joy, creativity, and authentic self-expression in the world through your unique talents and optimistic communication. You are here to uplift spirits, share innovative ideas, and remind others of the beauty and fun in life, often acting as a muse or a catalyst for creative energy.",
    "color": "Yellow – Symbolizing joy, intellect, optimism, creativity, and communication. It reflects your bright, cheerful, and expressive nature, as well as your mental agility.",
    "vibration": "Bright, joyful, and expressive – Your energy is typically uplifting, light-hearted, and stimulating, encouraging conversation, laughter, and the sharing of ideas. You bring a sense of vibrancy to your surroundings."
  },
  "4": {
    "description": "Hardworking and practical, you excel in organization, detail, and building solid foundations. You are the bedrock of many successful endeavors, known for your reliability, methodical approach, and unwavering commitment to seeing tasks through to completion.",
    "advice": "Be open to new ideas, embrace flexibility, and avoid becoming too rigid in your thinking or methods. While your structured approach is a strength, allowing for innovation and adaptability can prevent stagnation and open up new avenues for success. Learn to distinguish between carefulness and overcautiousness.",
    "master": false,
    "element": "Earth – Representing your grounded nature, practicality, stability, and connection to the material world. Like earth, you provide a solid foundation for growth and structure.",
    "traits": [
      "Reliable – Consistently dependable and trustworthy; others know they can count on you to fulfill your commitments and responsibilities.",
      "Disciplined – Possessing strong self-control and the ability to adhere to routines, rules, and systematic approaches to achieve long-term goals.",
      "Methodical – Approaching tasks in a logical, step-by-step, and organized manner, paying close attention to detail and process."
    ],
    "strengths": [
      "Dependable – Being a person others can consistently rely on for support, accuracy, and thoroughness in all undertakings.",
      "Patient – Demonstrating the ability to persevere through tedious tasks or long-term projects with endurance and a calm, steady approach.",
      "Systematic – Excelling at creating and implementing effective systems and processes that ensure efficiency, order, and quality results."
    ],
    "weaknesses": [
      "Stubborn – Can be resistant to changing your mind or methods once a decision is made, sometimes adhering too strictly to established plans.",
      "Overcautious – A tendency to be excessively careful, which can lead to missed opportunities or slow progress due to fear of risk or making mistakes.",
      "Rigid – May struggle with adapting to unexpected changes or new approaches, preferring the comfort and predictability of established routines and rules."
    ],
    "business": "Engineering, construction, architecture, accounting and finance, project management, data analysis, system administration, craftsmanship (e.g., carpentry, mechanics), law, research, quality control, or any field requiring precision, meticulous planning, and the creation of tangible, lasting results.",
    "relationships": "You seek stable, secure, and reliable relationships built on deep trust, unwavering commitment, and shared practical values. You appreciate a partner who is honest, dependable, and contributes to a sense of order and predictability in life. Loyalty and consistency are highly valued.",
    "purpose": "To create lasting structures, robust systems, and a sense of order and stability in the world. You are here to build, maintain, and provide practical solutions that benefit society by ensuring things work efficiently, reliably, and endure over time. Your work often forms the foundation upon which others can build.",
    "color": "Green – Symbolizing growth, stability, practicality, balance, and the natural order. It reflects your grounded, dependable, and constructive nature.",
    "vibration": "Grounded, stable, and dependable – Your energy provides a sense of security, calm, and reliability. You are a centering force, bringing practicality and a reassuring presence to any situation or group."
  },
  "5": {
    "description": "Adventurous and dynamic, you thrive on constant change, freedom of movement, and a wide variety of experiences. You are a natural explorer, always seeking the next horizon and embracing the unknown with infectious enthusiasm and a curious mind.",
    "advice": "Practice patience, cultivate discipline, and take on responsibility to ground your impulsiveness and make the most of your varied experiences. Learn to see important tasks through to completion and understand that true freedom also comes from a focused and disciplined application of your dynamic energy.",
    "master": false,
    "element": "Air – Symbolizing your quick mind, love of freedom, expansive communication skills, and constant movement. Like the wind, you are hard to pin down, always exploring new territories and ideas.",
    "traits": [
      "Energetic – Possessing a high level of vitality, zest for life, and an enthusiasm that fuels your adventurous pursuits and interactions.",
      "Curious – Driven by an insatiable desire to learn, explore new things, meet new people, and understand the diverse world around you.",
      "Adaptable – Able to adjust quickly and effectively to new environments, changing situations, or unexpected challenges, often thriving in flux."
    ],
    "strengths": [
      "Versatile – Capable of excelling in many different areas, quick to pick up new skills, and able to wear many hats with ease.",
      "Innovative – Often coming up with new ideas, progressive solutions, and unconventional approaches, unconstrained by traditional thinking.",
      "Lively – Bringing an infectious energy, wit, and excitement to your interactions and endeavors, making you a stimulating companion."
    ],
    "weaknesses": [
      "Impulsive – Prone to making sudden decisions or taking risks without fully considering the long-term consequences, driven by a desire for novelty.",
      "Restless – Finding it difficult to stay in one place, focus on one thing, or stick to routines for too long, always seeking new stimulation and experiences.",
      "Inconsistent – May struggle with follow-through and commitment in projects or relationships due to a fear of being tied down or missing out on other opportunities."
    ],
    "business": "Sales (especially requiring travel or networking), tourism and travel industry, journalism and media, marketing and advertising (particularly dynamic campaigns or social media), public relations, freelance consulting, event planning and management, entrepreneurship in fast-paced or innovative fields, entertainment, or any career offering variety, autonomy, and the chance to engage with many people and ideas.",
    "relationships": "You seek partners who share your adventurous spirit, embrace change and excitement, and offer intellectual stimulation and personal freedom. A relationship that allows for individual growth, mutual exploration of new experiences, open-minded communication, and avoids clinginess or rigid routines is ideal for your expansive nature.",
    "purpose": "To explore the world in all its facets, experience life to the fullest, and inspire others to embrace change, adapt to new circumstances, and live with a profound sense of freedom and curiosity. You are here to demonstrate the joy of discovery, the importance of adaptability, and the value of a life lived without fear of the unknown.",
    "color": "Turquoise – Symbolizing freedom, expansive communication, creativity, healing, and the refreshing energy of the ocean and sky. It reflects your adventurous spirit, desire for open horizons, and ability to connect with diverse perspectives.",
    "vibration": "Energetic, adventurous, and stimulating – Your presence is often invigorating and magnetic, encouraging others to step out of their comfort zones, embrace new possibilities, and engage with life more fully. You bring a dynamic and refreshing breeze wherever you go."
  },
  "6": {
    "description": "Nurturing and responsible, you are deeply connected to family, community, and the well-being of others. You are a natural caregiver, finding fulfillment in creating harmony, offering support, and taking care of those around you.",
    "advice": "Balance your profound care for others with your own essential needs and self-care practices. Learn to set healthy boundaries to avoid emotional exhaustion and resentment, and recognize that empowering others sometimes means letting them take responsibility for themselves.",
    "master": false,
    "element": "Earth – Representing your grounded, stable, and nurturing qualities. You provide a sense of security and belonging, much like the supportive Earth itself.",
    "traits": [
      "Caring – Genuinely concerned for the welfare of others, often putting their needs before your own.",
      "Protective – Having a strong instinct to shield and defend loved ones, community members, or those you perceive as vulnerable.",
      "Loyal – Deeply committed and steadfast in your relationships and responsibilities, offering unwavering support."
    ],
    "strengths": [
      "Compassionate – Possessing a deep empathy and a sincere desire to alleviate suffering and provide comfort.",
      "Reliable – Being consistently dependable and trustworthy; others know they can count on you in times of need.",
      "Supportive – Offering encouragement, practical help, and emotional sustenance to foster growth and well-being in others."
    ],
    "weaknesses": [
      "Overprotective – Your desire to care can sometimes become smothering or interfere with others' independence and learning.",
      "Self-sacrificing – May neglect your own needs and desires to an unhealthy extent in your dedication to others.",
      "Controlling – In your effort to ensure harmony and safety, you might become overly directive or meddlesome in the lives of others."
    ],
    "business": "Teaching (especially younger children or special needs), nursing and healthcare professions, social work, counseling, caregiving for children or the elderly, human resources, community management, non-profit leadership, interior design (creating harmonious spaces), chef or hospitality roles focused on comfort and care.",
    "relationships": "You seek loving, stable, and supportive relationships built on deep trust, mutual commitment, and emotional security. A partner who appreciates your nurturing nature, reciprocates care, and values family and home life is essential. You thrive in relationships where there is a strong sense of belonging and mutual responsibility.",
    "purpose": "To heal, nurture, and support others, creating harmony, balance, and a sense of community wherever you are. You aim to build a loving and secure environment for those around you, fostering responsibility and care within families and social structures.",
    "color": "Blue (often a deep, comforting blue) – Symbolizing peace, responsibility, compassion, and emotional depth. It reflects your calm, nurturing, and protective nature.",
    "vibration": "Calm, nurturing, and supportive – Your presence often brings a sense of peace, security, and comfort. People feel safe and cared for around you, drawn to your dependable and loving energy."
  },
  "7": {
    "description": "Intellectual, analytical, and introspective, you are a seeker of truth, knowledge, and deeper meaning. You possess a keen mind, a love for solitude, and a natural inclination towards research, analysis, and spiritual exploration.",
    "advice": "Balance your rich inner world by engaging more actively with others and learning to express your profound thoughts and insights openly. Trust in sharing your wisdom, as it can greatly benefit others, and be mindful of not becoming overly isolated or detached.",
    "master": false,
    "element": "Water – Reflecting your depth, intuition, and mysterious nature. Like still waters, you possess a calm surface that hides profound intellectual and spiritual currents.",
    "traits": [
      "Analytical – Possessing a sharp, probing mind that enjoys dissecting information, uncovering patterns, and seeking logical explanations.",
      "Spiritual – Often drawn to philosophical, metaphysical, or esoteric studies, seeking to understand the deeper mysteries of life and existence.",
      "Thoughtful – Prone to deep contemplation and reflection, carefully considering matters before forming opinions or making decisions."
    ],
    "strengths": [
      "Insightful – Having the ability to see beyond the surface, perceive hidden truths, and offer unique perspectives.",
      "Intuitive – Possessing a strong inner guidance system and an ability to understand things without conscious reasoning.",
      "Wise – Often accumulating a depth of knowledge and understanding that translates into sound judgment and perceptive advice."
    ],
    "weaknesses": [
      "Reserved – Can be shy, aloof, or find it difficult to share personal feelings and thoughts, preferring to keep to yourself.",
      "Skeptical – While analytical, can sometimes become overly critical, cynical, or distrustful of things not proven by logic or personal experience.",
      "Isolated – Your need for solitude, if unchecked, can lead to loneliness, detachment from others, or difficulty forming close relationships."
    ],
    "business": "Research (scientific, academic, market), data science and analysis, writing (technical, philosophical, investigative), philosophy, theology or spiritual teaching, software development or IT analysis, detective work, archivist, librarian, psychologist, or any field requiring deep thinking, specialization, and uncovering hidden knowledge.",
    "relationships": "You seek partners who respect your profound need for solitude and personal space, and who support your intellectual or spiritual pursuits. An ideal relationship involves deep mental and spiritual connection, intelligent conversation, and mutual understanding without excessive demands for social engagement. Superficial connections hold little appeal.",
    "purpose": "To uncover hidden truths, delve into the mysteries of the universe, and bring profound spiritual or intellectual insights to the world. You are here to research, analyze, contemplate, and share wisdom that can elevate understanding and awareness.",
    "color": "Violet or Purple – Symbolizing wisdom, spirituality, intuition, introspection, and the search for higher knowledge. It reflects your connection to deeper, often unseen, realms of thought.",
    "vibration": "Mystical, introspective, and wise – Your aura often carries an air of quiet intelligence, mystery, and depth. People may be intrigued by your thoughtful presence and seek your unique insights, even if you are not overtly outgoing."
  },
  "8": {
    "description": "Ambitious, authoritative, and results-driven, you strive for success, power, and material achievement. You are a natural leader with a strong sense of strategy, efficiency, and the ability to manage large-scale endeavors.",
    "advice": "Use your considerable influence, power, and resources wisely, ethically, and with a sense of broader responsibility. Balance your drive for achievement with empathy and ensure your success benefits not only yourself but also contributes positively to the community or world around you.",
    "master": false,
    "element": "Earth – Signifying your practical approach, ability to manifest in the material world, and your strong, grounded presence. You build tangible success and empires.",
    "traits": [
      "Confident – Possessing strong self-assurance and a belief in your ability to achieve significant goals and overcome challenges.",
      "Practical – Focusing on what works, tangible results, and efficient methods rather than abstract theories or sentimentality.",
      "Goal-oriented – Driven by clear objectives and a powerful determination to see them through to successful completion."
    ],
    "strengths": [
      "Efficient – Excelling at organizing resources, streamlining processes, and achieving maximum productivity with minimal waste.",
      "Organized – Naturally skilled at planning, structuring, and managing complex projects or organizations effectively.",
      "Strong-willed – Demonstrating immense determination, resilience, and the inner fortitude to overcome obstacles and persevere towards your vision."
    ],
    "weaknesses": [
      "Materialistic – Can become overly focused on acquiring wealth, status, and possessions, sometimes at the expense of other values.",
      "Domineering – Your authoritative nature can sometimes lead to being overly controlling, bossy, or dismissive of others' input.",
      "Workaholic – Prone to excessive devotion to work, potentially neglecting personal relationships, health, and other aspects of life."
    ],
    "business": "Business management (CEO, executive), finance and banking, law (especially corporate), real estate development, entrepreneurship (building large enterprises), politics, project management on a grand scale, investment, consulting for major corporations, or any field requiring strong leadership, strategic thinking, and financial acumen.",
    "relationships": "You seek partners who are strong, independent, supportive, and share your ambition and drive, or at least understand and respect it. A power-couple dynamic can be appealing, where both partners are building something significant, either together or in their respective fields. Mutual respect for competence and goals is crucial.",
    "purpose": "To achieve material success, build influential structures, and use your power and resources to create a positive and lasting impact on the world. You are here to lead, manage, and manifest abundance, ideally with a vision that extends to empowering others and contributing to societal progress.",
    "color": "Brown, Deep Red, or Black – Symbolizing power, authority, stability, wealth, and a connection to the material world. These colors reflect your grounded strength and executive presence.",
    "vibration": "Powerful, grounded, and resourceful – Your energy commands respect and conveys a sense of authority and competence. You naturally exude an aura of control and the ability to make things happen in the material realm."
  },
  "9": {
    "description": "Compassionate, generous, and deeply empathetic, you are a humanitarian at heart with a strong desire to make the world a better place. You possess a broad understanding of human nature and feel a sense of responsibility towards the collective good.",
    "advice": "Practice healthy detachment and learn to set boundaries to avoid over-involvement or emotional burnout from taking on the world's problems. Channel your immense compassion into sustainable forms of service, and remember that self-care is crucial to maintain your ability to help others.",
    "master": false,
    "element": "Fire – Representing your passion for your ideals, your inspirational qualities, and your warm, encompassing nature. Your fire fuels your desire to uplift and transform.",
    "traits": [
      "Idealistic – Holding a strong belief in the potential for good in humanity and striving for a more perfect world.",
      "Creative – Often possessing artistic talents or an innovative approach to problem-solving, especially in service of your humanitarian goals.",
      "Empathetic – Having a profound ability to feel and understand the emotions and experiences of others, even those vastly different from yourself."
    ],
    "strengths": [
      "Altruistic – Genuinely selfless in your desire to help others, often putting the needs of the greater good before your own.",
      "Inspirational – Able to motivate and uplift others through your vision, passion, and commitment to humanitarian causes.",
      "Charismatic – Possessing a natural charm and appeal that draws people to you and your ideals, making you an effective advocate."
    ],
    "weaknesses": [
      "Impatient (with injustice or slow progress) – Can become frustrated when ideals are not met quickly or when facing indifference to suffering.",
      "Overemotional – Your deep empathy can sometimes lead to being overwhelmed by the suffering of others or by the scale of global issues.",
      "Unrealistic – Your strong idealism might sometimes lead to impractical expectations or disillusionment when reality falls short."
    ],
    "business": "Charity work and non-profit organizations (founder, director, fundraiser), social activism and advocacy, arts and creative fields with a social message, healing professions (holistic or traditional), teaching (especially inspiring global awareness), international aid, spiritual counseling, philanthropy, or any role where you can serve humanity on a broad scale.",
    "relationships": "You seek partners who share your deep compassion, humanitarian values, and are committed to making a positive difference in the world. A relationship built on shared ideals, mutual support for selfless endeavors, and a deep spiritual or philosophical connection is fulfilling. Tolerance and understanding are key.",
    "purpose": "To uplift humanity, alleviate suffering, and contribute to a more compassionate, just, and enlightened world through selfless service, creative expression, and inspiring others to embrace their own philanthropic potential. You are here to embody unconditional love and global consciousness.",
    "color": "Gold or Rainbow Hues – Symbolizing universal love, wisdom, generosity, and the encompassing nature of your compassion. Gold also represents the high value of your spiritual contributions.",
    "vibration": "Warm, generous, and uplifting – Your energy is expansive and inclusive, often making people feel understood, accepted, and inspired. You radiate a sense of universal love and a desire for collective well-being."
  },
  "11": {
    "description": "Highly intuitive, visionary, and spiritually connected, you operate on a higher frequency of awareness. You are here to inspire and illuminate, often acting as a channel for profound insights and a messenger of higher truths.",
    "advice": "Ground your powerful visions in practical action and develop robust stress management techniques to navigate your heightened sensitivity. Learn to trust your intuition while also finding tangible ways to manifest your insights for the benefit of others without becoming overwhelmed.",
    "master": true,
    "element": "Air (often seen as ethereal or 'Spirit') – Symbolizing your connection to higher planes of thought, inspiration, and the transmission of spiritual ideas. You bridge the spiritual and material.",
    "traits": [
      "Inspiring – Possessing the ability to uplift, motivate, and fill others with a sense of purpose and spiritual connection through your words and presence.",
      "Intuitive – Having exceptionally strong inner knowing, psychic sensitivity, and an ability to perceive truths beyond the physical senses.",
      "Enlightened (or seeking enlightenment) – Often possessing or striving for a deep spiritual understanding, wisdom, and a connection to universal consciousness."
    ],
    "strengths": [
      "Charismatic – Exuding a magnetic and often spiritually infused presence that draws people to you and your message.",
      "Innovative (in thought and spirit) – Bringing forth new spiritual concepts, artistic expressions, or visionary ideas that can inspire change.",
      "Sensitive – Highly attuned to the energies and emotions of others and the environment, allowing for deep empathy and understanding."
    ],
    "weaknesses": [
      "Nervous (or prone to anxiety) – Your heightened sensitivity can make you susceptible to stress, nervous tension, and absorbing negative energies.",
      "Overwhelmed – Can easily become overloaded by the intensity of your own insights, the suffering of others, or the demands of the material world.",
      "Anxious (about fulfilling your potential) – May feel a deep sense of responsibility or pressure related to your unique gifts, leading to anxiety or self-doubt."
    ],
    "business": "Spiritual guidance and teaching, intuitive counseling or healing, inspirational speaking or writing, visionary arts (music, painting, poetry), psychic or mediumship work, innovative forms of therapy, humanitarian work driven by spiritual insight, or any field where you can share your unique vision and inspire others towards greater awareness.",
    "relationships": "You seek partners who are spiritually aware, emotionally intelligent, and deeply appreciate your sensitivity and unique worldview. A relationship offering mutual support for spiritual growth, understanding of your need for quiet reflection, and a shared journey towards higher consciousness is ideal. Authenticity and deep connection are paramount.",
    "purpose": "To enlighten, uplift, and inspire humanity with your profound spiritual insights, intuitive wisdom, and visionary ideas. You are here to act as a conduit for higher awareness, helping others to connect with their own spiritual nature and to envision a more harmonious world.",
    "color": "Silver or Iridescent White – Symbolizing intuition, illumination, purity, spiritual connection, and the reflection of higher light. These colors represent your conduit-like nature.",
    "vibration": "Elevated, visionary, and spiritual – Your energy is often perceived as highly refined, inspiring, and somewhat ethereal. You can uplift the atmosphere around you and open others to higher perspectives and spiritual possibilities."
  },
  "22": {
    "description": "The Master Builder, you possess the extraordinary ability to turn grand dreams and ambitious visions into tangible reality. You combine practical skills with profound inspiration to create structures and systems of lasting significance.",
    "advice": "Focus your immense power and discipline on your most significant goals, ensuring they are used to benefit humanity on a large scale. Maintain a balance between your ambitious drive and your personal well-being, and cultivate patience with the process and with others.",
    "master": true,
    "element": "Earth (Mastery over Earth) – Representing your unparalleled ability to manifest large-scale, practical, and enduring creations in the material world, grounded by visionary insight.",
    "traits": [
      "Practical (on a grand scale) – Capable of translating immense visions into workable plans and concrete outcomes.",
      "Disciplined – Possessing exceptional focus, determination, and the ability to manage vast undertakings with methodical precision.",
      "Visionary – Able to conceive of large-scale projects and systems that have the potential for significant, widespread impact."
    ],
    "strengths": [
      "Organized (Master Organizer) – Excelling at structuring, coordinating, and managing complex systems, resources, and teams for maximum efficiency.",
      "Reliable (for major undertakings) – Demonstrating unwavering dependability in achieving monumental goals and bringing ambitious plans to fruition.",
      "Strong leadership (Inspirational and Practical) – Able to inspire and direct large groups of people towards a common, significant objective."
    ],
    "weaknesses": [
      "Perfectionist – Your high standards can lead to being overly critical of yourself and others, or getting bogged down in details.",
      "Stubborn (with a powerful will) – Can be highly resistant to changing plans or perspectives, even when flexibility is needed, due to the intensity of your focus.",
      "Workaholic (driven by immense purpose) – May dedicate yourself so completely to your grand projects that personal life and health suffer significantly."
    ],
    "business": "Architecture on a large scale, international engineering projects, founding and leading global businesses or organizations, urban planning, large-scale project management, statesmanship or political leadership with a focus on infrastructure, philanthropy (building impactful institutions), or any endeavor that requires building something substantial and enduring for the collective good.",
    "relationships": "You seek partners who are exceptionally strong, deeply supportive, share your grand vision or have their own significant purpose, and can understand the immense demands of your path. A relationship built on mutual respect for each other's missions, shared ambition (or understanding of it), and unwavering support is vital. They must be able to handle your intensity and dedication.",
    "purpose": "To build lasting structures, systems, and organizations that benefit humanity on a broad and enduring scale. You are here to manifest powerful visions into concrete reality, create tangible legacies, and lead significant endeavors that improve the world in practical and impactful ways.",
    "color": "Steel Blue or Deep Indigo – Symbolizing strength, stability, vastness, wisdom, and the ability to manifest great structures. These colors reflect your power and profound building capacity.",
    "vibration": "Strong, steady, and transformative – Your energy is profoundly powerful, grounded, and capable of bringing about significant, tangible change. You exude an aura of competence, authority, and the capacity to achieve the seemingly impossible."
  },
  "33": {
    "description": "The Master Teacher, you embody unconditional love, profound compassion, and a powerful healing presence. You are dedicated to uplifting and serving humanity through selfless acts of kindness, spiritual guidance, and creative inspiration.",
    "advice": "Balance your immense desire to help and heal others with dedicated self-care and healthy emotional boundaries. Your capacity for giving is vast, but it must be replenished to avoid burnout and ensure your service remains joyful and sustainable. Teach by example, but also allow others their own journey.",
    "master": true,
    "element": "Water (Mastery over the emotional/spiritual realms) – Representing your boundless compassion, healing abilities, and profound emotional and spiritual depth. You are a source of unconditional love and nurturing.",
    "traits": [
      "Compassionate (to an extraordinary degree) – Possessing a boundless empathy and an all-encompassing love for humanity, feeling a deep connection to all beings.",
      "Selfless (in service) – Driven by a profound desire to serve others without expectation of personal gain, often putting the needs of humanity first.",
      "Creative (in healing and expression) – Utilizing artistic, teaching, or healing talents to uplift, inspire, and mend spirits on a large scale."
    ],
    "strengths": [
      "Inspirational (through love) – Able to uplift, motivate, and transform others through the sheer power of your loving presence and compassionate actions.",
      "Devoted (to service) – Unwaveringly committed to your mission of healing, teaching, and alleviating suffering in the world.",
      "Nurturing (on a universal scale) – Possessing an extraordinary ability to foster growth, provide comfort, and create a safe space for healing for individuals and communities."
    ],
    "weaknesses": [
      "Overly self-sacrificing – Can neglect personal needs to a detrimental extent, risking emotional and physical exhaustion in your drive to serve.",
      "Idealistic (to the point of vulnerability) – Your profound belief in the good of humanity can sometimes make you vulnerable to being taken advantage of or deeply wounded by harsh realities.",
      "Sensitive (to suffering) – Your deep empathy means you feel the pain of the world acutely, which can be overwhelming if not managed with strong spiritual grounding."
    ],
    "business": "Global healing arts (founder of methods or large centers), spiritual teaching on a mass scale, leading major humanitarian organizations, counseling and psychotherapy with a focus on deep healing, influential artistic creation (music, writing, art) that promotes love and unity, advocating for global compassion and justice, or any role where you can provide profound healing and uplifting guidance to large numbers of people.",
    "relationships": "You seek partners who are deeply compassionate, spiritually aligned, and share your profound commitment to serving humanity. A relationship built on unconditional love, mutual support in spiritual endeavors, and a shared vision for a better world is essential. Your partner must understand and honor your selfless nature and need to give.",
    "purpose": "To heal, uplift, and enlighten humanity through acts of selfless service, the teaching of unconditional love, and embodying profound compassion. You are here to be a beacon of hope, a source of immense comfort, and a guide towards a more loving and harmonious existence for all.",
    "color": "Pearl White, Opalescent, or Rose Gold – Symbolizing purity, unconditional love, spiritual enlightenment, divine healing, and the highest form of compassion. These colors reflect your gentle yet powerful spiritual radiance.",
    "vibration": "Pure, loving, and nurturing (with immense power) – Your energy is exceptionally gentle, healing, and profoundly comforting, yet carries an underlying strength and transformative power. You radiate an aura of unconditional love that can touch and heal many souls."
  }
}