{
  "1": {
    "description": "Number 1 represents the origin, the initiator, and the pioneering force in numerology. It embodies raw willpower, ambition, and the desire to stand out, lead, and manifest one's own destiny. Individuals with this number often radiate confidence and originality, striving to blaze their own path rather than follow the crowd.",
    "advice": "Use your drive constructively by balancing ambition with humility. Avoid arrogance or the temptation to dominate others. Embrace leadership, but remember that true strength lies in empowering others.",
    "master": false,
    "element": "Fire",
    "color": "Red",
    "vibration": "Initiating Force of Will",
    "traits": ["Ambitious", "Independent", "Confident", "Assertive", "Innovative", "Determined"],
    "strengths": [
      "Natural-born leader with strong decision-making abilities",
      "Highly self-motivated and forward-thinking",
      "Original thinker capable of starting new ventures",
      "Possesses the courage to take risks and challenge the status quo"
    ],
    "weaknesses": [
      "Can be domineering, egocentric, or overly competitive",
      "Impatience with slower or less driven individuals",
      "Difficulty accepting criticism or collaborating with others",
      "May struggle with loneliness due to self-reliance"
    ],
    "business": "Excels in leadership roles, entrepreneurship, innovation, and any field requiring initiative—such as tech, business development, or pioneering new markets.",
    "relationships": "Seeks partners who admire their strength and support their independence. Needs space and respect, and may struggle with emotional vulnerability.",
    "purpose": "To lead with integrity, create original paths, and demonstrate the power of self-determination and focused intent."
  },
  "2": {
    "description": "Number 2 is the number of diplomacy, partnership, and peace. It symbolizes duality and balance—soft power rather than force. Those influenced by 2 possess emotional sensitivity, intuitive understanding, and a deep need for harmony within and around them.",
    "advice": "Cultivate inner confidence to avoid dependence on external validation. Be assertive when needed and honor your own needs alongside others'.",
    "master": false,
    "element": "Water",
    "color": "Light Blue",
    "vibration": "Peace and Duality",
    "traits": ["Empathetic", "Diplomatic", "Cooperative", "Tactful", "Loyal", "Sensitive"],
    "strengths": [
      "Excellent mediator and team player",
      "Emotionally intelligent and intuitively aware",
      "Natural peacemaker with a calming presence",
      "Deeply supportive and reliable in relationships"
    ],
    "weaknesses": [
      "Can become overly dependent or self-sacrificing",
      "May avoid confrontation to keep peace",
      "Tends toward indecision and internal conflict",
      "Prone to emotional overwhelm or silent resentment"
    ],
    "business": "Thrives in cooperative roles, counseling, diplomacy, client services, and mediation. Ideal for supportive roles that require finesse and emotional intelligence.",
    "relationships": "Craves deep emotional bonds and emotional security. Best matched with partners who value mutual respect, gentleness, and emotional honesty.",
    "purpose": "To foster peace, cooperation, and emotional connection through diplomacy, support, and sensitive understanding."
  },
  "3": {
    "description": "Number 3 is the expressive communicator, the artist, and the joyful spirit. It is associated with creativity, inspiration, and an infectious zest for life. Those with this number are natural performers, wordsmiths, or artists who uplift others through beauty, humor, and storytelling.",
    "advice": "Focus your energy to avoid becoming scattered or superficial. Your gift lies in deep expression—don't waste it on triviality or distraction.",
    "master": false,
    "element": "Air",
    "color": "Yellow",
    "vibration": "Joyful Expression",
    "traits": ["Expressive", "Creative", "Optimistic", "Social", "Witty", "Energetic"],
    "strengths": [
      "Highly imaginative and artistically gifted",
      "Charismatic, charming, and emotionally vibrant",
      "Able to uplift others through humor and beauty",
      "Fluent communicator in speech, writing, or art"
    ],
    "weaknesses": [
      "Prone to emotional highs and lows",
      "Can be easily distracted or avoid responsibility",
      "May use humor to deflect deeper feelings",
      "Struggles with long-term discipline or planning"
    ],
    "business": "Excels in media, writing, performing arts, marketing, public relations, and any creative industry where imagination is key.",
    "relationships": "Fun-loving and expressive. Needs emotionally intelligent partners who appreciate spontaneity and creativity, but also provide grounding.",
    "purpose": "To inspire, entertain, and uplift others through joyful, heartfelt self-expression and creative authenticity."
  },
  "4": {
    "description": "Number 4 is the builder, the foundation, and the organizer. It represents discipline, loyalty, and the work ethic needed to construct lasting systems or legacies. Those with this number seek structure, reliability, and tangible results in all areas of life.",
    "advice": "Embrace flexibility when needed—rigidity can become a limitation. Trust the process without micromanaging the outcome.",
    "master": false,
    "element": "Earth",
    "color": "Green",
    "vibration": "Foundational Builder",
    "traits": ["Reliable", "Practical", "Disciplined", "Loyal", "Organized", "Methodical"],
    "strengths": [
      "Grounded and dependable in all endeavors",
      "Meticulous planner with long-term vision",
      "Willing to work hard and build from the ground up",
      "Creates lasting systems and structures"
    ],
    "weaknesses": [
      "Overly cautious or resistant to change",
      "Can be rigid, dogmatic, or overly critical",
      "May struggle with spontaneity or emotional expression",
      "Risk of becoming overly controlling or perfectionist"
    ],
    "business": "Ideal for engineering, construction, project management, accounting, or law enforcement. Thrives in roles requiring precision and responsibility.",
    "relationships": "Values loyalty, honesty, and long-term commitment. Needs stability, security, and mutual respect in relationships.",
    "purpose": "To build lasting structures—both physical and metaphorical—that bring stability and service to others through integrity and diligence."
  },
  "5": {
    "description": "Number 5 is the free spirit, the explorer, and the catalyst for change. It thrives on experience, freedom, and adventure. Those influenced by this number often seek variety and dislike routine, craving dynamic environments and constant evolution.",
    "advice": "Channel your restless energy into constructive goals. Learn to commit without sacrificing your independence.",
    "master": false,
    "element": "Air",
    "color": "Turquoise",
    "vibration": "Freedom in Motion",
    "traits": ["Adventurous", "Versatile", "Dynamic", "Curious", "Energetic", "Flexible"],
    "strengths": [
      "Adaptable to change and new environments",
      "Excellent communicator and persuasive speaker",
      "Inspires others with courage and curiosity",
      "Thrives in unconventional paths or roles"
    ],
    "weaknesses": [
      "Can be impulsive or commitment-averse",
      "Prone to restlessness and escapism",
      "May struggle with structure or discipline",
      "Risk of burnout due to constant motion"
    ],
    "business": "Excels in travel, sales, journalism, public relations, and consulting. Needs dynamic, fast-paced environments that allow movement and innovation.",
    "relationships": "Seeks stimulating, passionate connections. Needs space and shared interests to avoid feeling trapped or stagnant.",
    "purpose": "To embody freedom, experience life’s diversity, and catalyze transformation in themselves and others through exploration and example."
  },
  "6": {
    "description": "Number 6 is the nurturer, healer, and harmonizer. It radiates responsibility, compassion, and a deep desire to care for others. Those influenced by 6 are often drawn to service, justice, and the creation of a loving and aesthetically pleasing environment.",
    "advice": "Set healthy boundaries to avoid burnout. Help others from a place of fullness, not obligation or guilt.",
    "master": false,
    "element": "Earth",
    "color": "Indigo",
    "vibration": "Harmonious Responsibility",
    "traits": ["Caring", "Responsible", "Loving", "Protective", "Loyal", "Domestic"],
    "strengths": [
      "Natural caregiver and protector",
      "Deep sense of justice and moral responsibility",
      "Creates beauty, warmth, and peace in surroundings",
      "Strong interpersonal skills and emotional depth"
    ],
    "weaknesses": [
      "Can become overbearing or self-sacrificing",
      "Tends toward worry and control in relationships",
      "May feel unappreciated or taken advantage of",
      "Difficulty letting go of responsibility"
    ],
    "business": "Excels in caregiving, education, design, healthcare, social work, and community leadership. Thrives in roles that involve nurturing or restoring balance.",
    "relationships": "Seeks deeply bonded, emotionally rich connections. Often plays the protector or caregiver role and must guard against codependency.",
    "purpose": "To serve and heal through love, responsibility, and harmony. To create beauty, support, and balance in all aspects of life."
  },

  "7":{
  "description": "Deeply introspective and spiritually inclined, 7s are seekers of truth who are drawn to the mysteries of life. They are analytical thinkers who prefer solitude for study and contemplation.",
  "advice": "Balance solitude with social connection to avoid isolation. Trust your intuition as much as your logic.",
  "master": false,
  "element": "Water",
  "color": "Purple",
  "vibration": "Spiritual Seeker",
  "traits": ["Introspective", "Analytical", "Wise", "Private", "Curious"],
  "strengths": ["Insightful analysis", "Intellectual depth", "Spiritual attunement", "Persistence in research"],
  "weaknesses": ["Social withdrawal", "Overthinking", "Emotionally guarded", "Cynicism"],
  "business": "Thrives in research, science, psychology, investigative journalism, philosophy, and spiritual mentoring.",
  "relationships": "You value intellectual and spiritual connections. You need a partner who respects your need for space and encourages your inner growth.",
  "purpose": "To uncover hidden truths, develop spiritual wisdom, and serve as a guide for others seeking enlightenment."
},
  "8": {
  "description": "8s are the powerhouses of numerology—driven, ambitious, and capable of great material success. They are natural leaders with a gift for strategic thinking and financial acumen.",
  "advice": "Use your power with integrity. Avoid becoming too controlling or overly focused on status.",
  "master": false,
  "element": "Earth",
  "color": "Black or Dark Gray",
  "vibration": "Power Manifested",
  "traits": ["Ambitious", "Practical", "Efficient", "Goal-Oriented", "Decisive"],
  "strengths": ["Leadership", "Execution", "Financial strategy", "Endurance"],
  "weaknesses": ["Domineering", "Overly materialistic", "Emotionally distant", "Rigidity"],
  "business": "Excels in corporate leadership, finance, law, politics, entrepreneurship, and real estate development.",
  "relationships": "You seek a strong, grounded partner who supports your goals and matches your ambition. Loyalty and respect are vital.",
  "purpose": "To achieve mastery over the material world and uplift others by using your influence wisely and responsibly."
},

  "9": {
  "description": "The humanitarian of numerology, 9s are generous, creative, and emotionally expressive. You are idealists who are often drawn to social causes, healing work, or the arts.",
  "advice": "Don’t lose yourself in trying to save others. Ground your ideals in practical action.",
  "master": false,
  "element": "Fire",
  "color": "Gold",
  "vibration": "Universal Love",
  "traits": ["Generous", "Idealistic", "Creative", "Romantic", "Empathetic"],
  "strengths": ["Emotional intelligence", "Altruism", "Charisma", "Visionary thinking"],
  "weaknesses": ["Over-sacrificing", "Overly emotional", "Scattered focus", "Disillusionment"],
  "business": "Drawn to careers in the arts, counseling, philanthropy, humanitarian work, and holistic health.",
  "relationships": "You need a deeply emotional and meaningful connection. You often attract partners who need healing.",
  "purpose": "To bring healing and beauty to the world through love, art, service, and sacrifice."
},

  "11": {
  "description": "The most intuitive and spiritually gifted number, 11s are visionary messengers. You are here to uplift, inspire, and awaken others through your insight, creativity, and deep emotional sensitivity.",
  "advice": "Ground your energy daily to prevent emotional overwhelm. Use creative outlets to express your inner light.",
  "master": true,
  "element": "Air",
  "color": "Silver",
  "vibration": "Spiritual Illumination",
  "traits": ["Visionary", "Sensitive", "Inspirational", "Receptive", "Idealistic"],
  "strengths": ["Creative genius", "Spiritual insight", "Empathy", "High-frequency energy"],
  "weaknesses": ["Emotional overload", "Nervous tension", "Indecisiveness", "Avoidance of responsibility"],
  "business": "Ideal in fields like spiritual teaching, inspirational writing, counseling, filmmaking, or holistic healing.",
  "relationships": "You seek soul-level connections with emotionally mature, spiritual individuals. You need deep mutual understanding.",
  "purpose": "To elevate human consciousness through your light, truth, and divine inspiration. You are the spiritual torchbearer."
},

  "22": {
  "description": "The master builder of the material world, 22s combine idealism with execution. You possess the power to turn dreams into reality and impact the world on a massive scale.",
  "advice": "Temper your grand visions with patience and precision. Success takes structure and persistence.",
  "master": true,
  "element": "Earth",
  "color": "Platinum",
  "vibration": "Master Architect of Reality",
  "traits": ["Disciplined", "Powerful", "Strategic", "Visionary", "Methodical"],
  "strengths": ["Big-picture thinking", "Execution of complex plans", "Resilience", "Long-term vision"],
  "weaknesses": ["Perfectionism", "Overwhelm", "Workaholic tendencies", "Emotional suppression"],
  "business": "Leadership in infrastructure, international business, social reform, engineering, or systems innovation.",
  "relationships": "You value loyalty, strength, and shared goals. You often take on the provider or mentor role in relationships.",
  "purpose": "To build transformative legacies—physical, social, or spiritual—that uplift humanity and stand the test of time."
},
  "33": {
  "description": "The master teacher and spiritual healer, 33s are embodiments of unconditional love. You are devoted to service, healing, and spiritual upliftment on a soul-deep level.",
  "advice": "Don’t neglect your own needs while caring for others. Set energetic boundaries.",
  "master": true,
  "element": "Water",
  "color": "Pink",
  "vibration": "Divine Compassion",
  "traits": ["Compassionate", "Selfless", "Healing", "Artistic", "Intuitive"],
  "strengths": ["Emotional healing", "Creativity in service", "Sacrificial love", "Inspiration"],
  "weaknesses": ["Martyr complex", "Emotional exhaustion", "Overidentification with others' pain"],
  "business": "Fulfills purpose in counseling, teaching, holistic medicine, spiritual healing, or humanitarian leadership.",
  "relationships": "You need a supportive partner who understands your mission and respects your sensitive heart.",
  "purpose": "To awaken the heart of humanity through healing, teaching, and unconditional love. Your life is your message."
}
}